[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "WhatsApp Messenger is a fast, secure, and private way to stay in touch with the people who matter most. Designed for modern communication, it lets you chat, call, and share media instantly—no matter where you are in the world. Every message and call is protected by end-to-end encryption, ensuring your conversations remain private and secure. Beyond basic messaging, WhatsApp allows users to share documents, photos, videos, and voice messages with lightning-fast delivery and clarity.\n\nThis app focuses on simplicity and reliability, making global communication effortless. You can create group chats for family, friends, or colleagues, and even host group voice or video calls with up to hundreds of participants. The app syncs seamlessly across your phone and desktop, so your conversations are always in sync and accessible.\n\nFor those who manage work or community discussions, WhatsApp Business integration allows quick replies, status updates, and automated messages to streamline communication. Whether you're sharing a photo from your travels or coordinating a project remotely, WhatsApp makes every connection smoother, safer, and more personal.",
    "size": 120,
    "reviews": 145000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 110000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111463.png",
    "title": "Instagram",
    "companyName": "Instagram, Inc.",
    "id": 2,
    "description": "Instagram is your creative home for sharing life’s moments in photos, videos, and stories. Whether you’re exploring your passions, connecting with friends, or growing your business, Instagram offers a global platform to express who you are. With powerful editing tools, filters, and reels, you can turn any moment into something beautiful and engaging.\n\nBeyond personal sharing, Instagram helps creators and businesses build real communities. The Explore tab connects you with trending content, while reels showcase short, immersive videos from people all over the world. Direct messaging lets you chat privately with friends, collaborate with other creators, or discuss projects with clients.\n\nInstagram also supports shopping experiences within the app—browse products, follow your favorite brands, and discover new collections. From storytelling through visuals to community building through interaction, Instagram is not just a photo-sharing platform; it’s a lifestyle hub designed to inspire and connect billions of users globally.",
    "size": 180,
    "reviews": 120000000,
    "ratingAvg": 4.4,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 21000000 },
      { "name": "5 star", "count": 95000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968764.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Facebook connects billions of people around the globe, giving everyone the power to share, discover, and build communities. It’s where friendships grow, ideas spread, and voices are heard. With a single tap, you can post updates, photos, or videos to share your story with the world. Whether it’s staying in touch with family, joining interest-based groups, or discovering new events, Facebook helps you feel closer to what matters most.\n\nThe News Feed curates posts that are most relevant to your interests, while Marketplace allows you to buy and sell locally with ease. Live video brings real-time moments to life—perfect for events, discussions, and announcements. Pages and business tools let entrepreneurs engage directly with their customers, creating new opportunities every day.\n\nFacebook’s design emphasizes meaningful connections, and its integrated messaging and event features make planning, collaboration, and sharing effortless. It’s not just an app—it’s a social ecosystem that keeps your personal and professional life connected in one place.",
    "size": 200,
    "reviews": 160000000,
    "ratingAvg": 4.1,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 12000000 },
      { "name": "2 star", "count": 9000000 },
      { "name": "3 star", "count": 11000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 108000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/1384/1384060.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube is the world’s largest video platform, offering a limitless universe of entertainment, education, and creativity. From music videos and movie trailers to tutorials and live streams, it connects viewers and creators across every corner of the world. Whether you’re learning a new skill, following your favorite creators, or enjoying short-form content through YouTube Shorts, this app delivers personalized experiences through intelligent recommendations.\n\nCreators can upload videos easily, manage channels, and engage with their communities through comments, polls, and live chat. The platform supports HD and 4K streaming with adaptive playback, ensuring smooth viewing even on low connections. Premium users can enjoy ad-free experiences, background play, and offline downloads for uninterrupted enjoyment.\n\nYouTube isn’t just a video site—it’s a cultural hub where trends are born, knowledge is shared, and creativity flourishes. Whether you’re exploring educational content, entertainment, or inspiration, YouTube gives everyone a voice and a global stage.",
    "size": 210,
    "reviews": 180000000,
    "ratingAvg": 4.6,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 9000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 130000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/3046/3046126.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 5,
    "description": "TikTok is the ultimate short-form video platform that celebrates creativity, humor, and authenticity. With an endless stream of videos personalized for your interests, it offers a never-ending source of entertainment and inspiration. The app’s simple tools make it easy for anyone to create—whether you’re dancing, sharing comedy skits, cooking recipes, or showcasing your talent.\n\nTikTok’s powerful recommendation engine ensures every user’s feed feels unique, serving up content that matches your mood and preferences. Built-in editing tools, filters, and effects make storytelling fun and accessible. You can collaborate with other creators through duets and stitches, expanding your reach and creativity.\n\nBeyond entertainment, TikTok has evolved into a global platform for trends, education, and expression. From learning quick skills to joining viral challenges, every interaction sparks creativity. For creators, TikTok provides deep analytics, monetization options, and community support to grow your audience. It’s not just about watching videos—it’s about creating culture, one short clip at a time.",
    "size": 250,
    "reviews": 95000000,
    "ratingAvg": 4.3,
    "downloads": 3000000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 61000000 }
    ]
  },
  
  {
    "image": "https://cdn-icons-png.flaticon.com/512/174/174872.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 6,
    "description": "Spotify is the world’s leading music streaming platform that puts millions of songs, podcasts, and playlists at your fingertips. Discover new artists, follow your favorite musicians, and create personalized playlists that match your every mood. With Spotify, your soundtrack to life never stops playing—whether you're working, studying, driving, or relaxing.\n\nThe app’s intelligent recommendation system learns your listening habits and curates playlists like ‘Discover Weekly’ and ‘Daily Mix’ just for you. You can explore genres, moods, and even podcasts from creators around the world. Offline mode lets you download songs to enjoy anytime, without data usage.\n\nPremium users get ad-free listening, higher audio quality, and unlimited skips, while free users still enjoy access to the entire global music library. Spotify also offers collaborative playlists, group sessions, and lyrics syncing for sing-along fun. More than just a streaming app, Spotify is a community for music lovers—where every beat connects people worldwide.",
    "size": 190,
    "reviews": 120000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 17000000 },
      { "name": "5 star", "count": 92000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111421.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 7,
    "description": "Snapchat is a camera-based messaging app that lets you share moments in the most fun and creative way possible. Capture photos or videos, add filters, stickers, and AR lenses, and share them instantly with friends and family. Every snap disappears after being viewed—so your communication feels spontaneous, authentic, and private.\n\nThe app encourages genuine connections through features like Stories, Spotlight, and Chat. Stories allow you to post daily updates visible for 24 hours, while Spotlight showcases viral content from creators worldwide. With AR lenses and Bitmoji, Snapchat turns everyday communication into a playful and expressive experience.\n\nSnap Map helps you discover what’s happening around the world or see where your friends are, while Memories lets you save favorite moments securely. From personal messaging to discovering new trends, Snapchat combines privacy, creativity, and community—all in one innovative platform built for the next generation of communication.",
    "size": 210,
    "reviews": 85000000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 54000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111646.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Telegram is a cloud-based messaging platform focused on speed, privacy, and freedom. It lets you connect instantly through chats, channels, and groups—without compromising your data. With powerful end-to-end encryption options, Telegram ensures your personal conversations remain secure, even on public networks.\n\nUnlike other apps, Telegram allows groups with up to 200,000 members, file sharing up to 2GB, and cloud syncing across all devices. The app is lightning fast and doesn’t require heavy storage on your phone, as everything is stored securely in the cloud.\n\nDevelopers and communities love Telegram for its open API, bot integrations, and custom themes. You can join global communities, subscribe to channels for updates, or simply message friends with expressive stickers and GIFs. Whether for personal use or professional coordination, Telegram delivers reliable communication with unmatched speed and simplicity.",
    "size": 160,
    "reviews": 60000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 41000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/733/733579.png",
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "id": 9,
    "description": "Twitter, now known as X, is a dynamic platform for real-time news, opinions, and conversations that shape the world. From breaking headlines to trending memes, X connects millions of voices in one global discussion. Whether you’re sharing updates, joining debates, or following your favorite personalities, X makes it simple to stay informed and engaged.\n\nThe app’s intuitive design lets you post text, photos, videos, and even long-form content. With Spaces, users can host live audio discussions, and Communities bring like-minded people together around shared interests. The new monetization tools also empower creators and journalists to earn from their content.\n\nWith customization, bookmarks, and enhanced verification features, X is transforming social interaction into an open digital town square. It’s not just a microblogging app anymore—it’s the heartbeat of modern communication and culture.",
    "size": 170,
    "reviews": 98000000,
    "ratingAvg": 4.0,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 19000000 },
      { "name": "5 star", "count": 59000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111615.png",
    "title": "Slack",
    "companyName": "Slack Technologies, LLC",
    "id": 10,
    "description": "Slack is the modern workspace communication hub designed to bring teams together. With organized channels, instant messaging, and integrated tools, Slack replaces endless email threads with fast, focused collaboration. Whether you’re managing projects, brainstorming ideas, or sharing quick updates, Slack keeps everyone connected and aligned.\n\nUsers can create public or private channels for departments, projects, or topics, making it easy to find and follow relevant discussions. With file sharing, reactions, and thread-based replies, conversations stay structured and easy to track. Slack also integrates with hundreds of productivity apps—like Google Drive, Trello, GitHub, and Zoom—creating a unified workflow inside one platform.\n\nVoice and video huddles make remote teamwork natural and human, while advanced search and history features ensure that nothing gets lost. From startups to global enterprises, Slack is where modern work happens—efficient, transparent, and always in sync.",
    "size": 230,
    "reviews": 35000000,
    "ratingAvg": 4.4,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 21000000 }
    ]
  },
  
  {
    "image": "https://cdn-icons-png.flaticon.com/512/145/145808.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 11,
    "description": "Pinterest is your personal discovery engine for finding inspiration, ideas, and creativity. From home decor and fashion to recipes and travel goals, Pinterest helps you explore everything that sparks your imagination. Save your favorite Pins, organize them into themed boards, and watch your ideas come to life one inspiration at a time.\n\nThe app’s smart algorithm tailors recommendations based on your interests, so your home feed always feels fresh and personal. You can follow creators, explore trends, and even shop directly from Pins that feature real products. Whether you’re redecorating your living room, planning your next vacation, or learning a new craft, Pinterest turns ideas into action.\n\nWith built-in image search, visual recognition, and video Pins, discovering new things has never been more interactive. For creators, Pinterest provides analytics and engagement tools to grow audiences and share original content. It’s more than a social platform—it’s a visual world of ideas waiting to be explored.",
    "size": 150,
    "reviews": 50000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 35000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/732/732228.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 12,
    "description": "Netflix is the world’s leading streaming entertainment service, offering unlimited access to movies, TV shows, documentaries, and original productions from every corner of the globe. From award-winning dramas to stand-up comedies, anime, and thrillers, Netflix brings stories that move the world—all ad-free.\n\nThe app delivers personalized recommendations based on what you love, ensuring there’s always something new to watch. You can download episodes to enjoy offline, manage multiple user profiles, and adjust streaming quality to suit your connection. Smart autoplay previews and top charts keep you updated on what’s trending.\n\nNetflix Originals like Stranger Things, Money Heist, and The Witcher redefine storytelling for a global audience. The platform also supports parental controls, multiple languages, and subtitles for a truly inclusive experience. Whether you’re at home or on the go, Netflix transforms every screen into a personal cinema.",
    "size": 250,
    "reviews": 180000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 141000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/906/906361.png",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 13,
    "description": "Zoom is the all-in-one communication platform for video meetings, webinars, and messaging—trusted by millions of professionals, educators, and organizations worldwide. It’s designed for simplicity, reliability, and security, making remote collaboration seamless whether you’re working from home, in the office, or on the move.\n\nThe app enables HD video and audio meetings for up to thousands of participants, with powerful features like screen sharing, breakout rooms, and virtual backgrounds. You can chat instantly, record sessions, and integrate Zoom with tools like Google Calendar and Slack for effortless scheduling.\n\nZoom prioritizes security with end-to-end encryption and user authentication to ensure safe communication. It’s ideal for business meetings, online classes, or family video calls—bringing people together wherever they are. With its intuitive interface and consistent performance, Zoom turns distance into connection.",
    "size": 220,
    "reviews": 95000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 19000000 },
      { "name": "5 star", "count": 62500000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/174/174857.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 14,
    "description": "LinkedIn is the world’s largest professional network that connects you to people, jobs, and opportunities that shape your career. Whether you’re job hunting, hiring talent, or sharing insights, LinkedIn gives you the tools to grow professionally and build meaningful connections.\n\nYour personalized feed keeps you updated on industry trends, company news, and professional discussions. You can showcase your experience, skills, and achievements on your profile to attract recruiters and partners. With LinkedIn Learning, users can access thousands of expert-led courses to develop new skills anytime, anywhere.\n\nThe app also enables direct messaging, community engagement through groups, and live broadcasts for thought leadership. From career advancement to networking and knowledge sharing, LinkedIn empowers professionals to achieve more together.",
    "size": 210,
    "reviews": 72000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 46500000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/906/906349.png",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 15,
    "description": "Microsoft Teams is a secure and collaborative workspace designed for modern hybrid work. It brings together chat, video meetings, file storage, and app integration—all in one unified platform. Teams helps organizations stay connected and productive, no matter where their members are located.\n\nYou can organize conversations by teams and channels, schedule video calls with just a click, and share files instantly through OneDrive and SharePoint integration. With built-in Office 365 apps, users can co-edit Word, Excel, and PowerPoint documents in real time during meetings.\n\nTeams supports advanced features like live captions, background blur, webinar hosting, and breakout rooms, ensuring seamless collaboration. Whether for education, corporate communication, or remote teamwork, Microsoft Teams empowers people to achieve more together with reliability, scalability, and enterprise-grade security.",
    "size": 260,
    "reviews": 85000000,
    "ratingAvg": 4.2,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 55500000 }
    ]
  },
  
  {
    "image": "https://cdn-icons-png.flaticon.com/512/732/732245.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 16,
    "description": "Gmail is Google’s secure and reliable email service designed to keep your communication organized and safe. With smart inbox features, your emails are automatically sorted into categories like Primary, Social, and Promotions, making it easier to focus on what matters most. Gmail’s advanced spam protection keeps unwanted messages out of your inbox.\n\nYou can send and receive attachments of any type, schedule emails to be sent later, and use labels and stars to categorize messages efficiently. The app integrates seamlessly with Google Calendar, Drive, Meet, and other Google services to streamline productivity.\n\nSmart Compose and Smart Reply help you write faster, while multiple account support allows you to manage both personal and professional emails in one app. Whether for work, school, or personal communication, Gmail provides a fast, intuitive, and secure way to stay connected anywhere, anytime.",
    "size": 120,
    "reviews": 250000000,
    "ratingAvg": 4.7,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 240000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888843.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 17,
    "description": "Google Drive is a cloud storage service that allows you to securely store, access, and share your files from any device. With 15GB of free space and the ability to upgrade, Drive makes it easy to keep documents, photos, videos, and more safely in one place. Access files offline and collaborate in real time with colleagues, friends, or family.\n\nDrive integrates seamlessly with Google Docs, Sheets, Slides, and other apps, allowing you to create, edit, and share without leaving the platform. Advanced search and organization features help you find what you need instantly. You can set permissions for shared files and track changes to maintain full control over your data.\n\nWhether for work, study, or personal use, Google Drive is a versatile and secure solution for file management, ensuring your content is always backed up, accessible, and collaborative.",
    "size": 100,
    "reviews": 70000000,
    "ratingAvg": 4.6,
    "downloads": 3000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 66000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888847.png",
    "title": "Evernote",
    "companyName": "Evernote Corporation",
    "id": 18,
    "description": "Evernote is a powerful note-taking and organization app designed to help you capture ideas, manage tasks, and stay productive. You can create notes, checklists, and reminders, attach documents, images, or voice recordings, and sync them seamlessly across all your devices. Its flexible notebook system lets you categorize, tag, and organize content efficiently.\n\nThe app supports web clipping to save articles, emails, and online content for later reading, making research and learning easier. Search is fast and robust, even recognizing text in images and PDFs. Evernote integrates with calendars, emails, and third-party apps, creating a smooth workflow for personal and professional projects.\n\nWhether you’re planning your next project, tracking your goals, or capturing fleeting ideas, Evernote is the digital workspace for keeping everything organized, searchable, and accessible wherever you go.",
    "size": 80,
    "reviews": 1500000,
    "ratingAvg": 4.2,
    "downloads": 30000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 1300000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888846.png",
    "title": "Notion",
    "companyName": "Notion Labs, Inc.",
    "id": 19,
    "description": "Notion is an all-in-one workspace that combines notes, tasks, databases, and collaboration in one intuitive platform. Designed for individuals, teams, and organizations, Notion allows you to write, plan, organize, and collaborate in a flexible environment. You can create pages, embed media, link databases, and customize layouts to suit your workflow.\n\nThe app’s modular approach allows users to create task boards, calendars, wikis, and knowledge bases without juggling multiple apps. Real-time collaboration ensures team members stay aligned, while templates help you quickly start projects. Notion also supports markdown, code snippets, and integrations with apps like Slack, Google Drive, and GitHub.\n\nWhether for project management, note-taking, or team collaboration, Notion centralizes your work in one digital space, making planning, documentation, and productivity seamless and visually organized.",
    "size": 100,
    "reviews": 500000,
    "ratingAvg": 4.4,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 450000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888850.png",
    "title": "Adobe Acrobat Reader",
    "companyName": "Adobe Inc.",
    "id": 20,
    "description": "Adobe Acrobat Reader is the industry-standard PDF viewer that lets you view, annotate, and share PDF documents easily. You can open PDFs from emails, the web, or cloud storage, and interact with forms, highlights, and comments. The app also provides tools for signing documents electronically and sending them securely.\n\nWith Acrobat Reader, you can fill forms, add digital signatures, and annotate documents with text, notes, and drawings. Integration with Adobe Document Cloud enables seamless access across devices, making your PDFs available anytime, anywhere. The app supports collaboration by allowing multiple users to comment and review documents in real time.\n\nWhether for professional work, school projects, or personal use, Adobe Acrobat Reader ensures a reliable, efficient, and secure way to handle all your PDF needs, making document management effortless.",
    "size": 110,
    "reviews": 2000000,
    "ratingAvg": 4.1,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888845.png",
    "title": "Microsoft Word",
    "companyName": "Microsoft",
    "id": 21,
    "description": "Microsoft Word is the industry-standard word processing app, designed to help you create, edit, and format documents with ease. Whether you’re writing essays, reports, or professional documents, Word provides a rich set of tools including templates, styles, formatting options, and advanced editing features.\n\nThe app supports real-time collaboration, allowing multiple users to edit the same document simultaneously while tracking changes and comments. Integration with OneDrive ensures your documents are automatically saved and accessible across devices. You can also insert images, charts, tables, and hyperlinks to make your content visually engaging.\n\nWhether for personal, academic, or professional work, Microsoft Word provides a complete, reliable, and efficient platform for all your document creation and editing needs.",
    "size": 100,
    "reviews": 1000000,
    "ratingAvg": 4.3,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 785000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888852.png",
    "title": "Microsoft Excel",
    "companyName": "Microsoft",
    "id": 22,
    "description": "Microsoft Excel is a powerful spreadsheet app used for data analysis, visualization, and organization. Create complex spreadsheets with formulas, pivot tables, charts, and conditional formatting to manage and analyze data efficiently. Excel is widely used in finance, business, research, and education for its versatility and robust functionality.\n\nThe app supports real-time collaboration, allowing teams to work together on the same spreadsheet seamlessly. Integration with OneDrive ensures automatic saving and access across multiple devices. Excel also includes templates for budgeting, project tracking, and reporting, making it easier to start and manage complex tasks.\n\nWhether analyzing data, managing budgets, or performing calculations, Microsoft Excel provides a comprehensive, reliable, and user-friendly platform to organize and interpret information effectively.",
    "size": 120,
    "reviews": 900000,
    "ratingAvg": 4.2,
    "downloads": 250000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 735000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888849.png",
    "title": "Google Sheets",
    "companyName": "Google LLC",
    "id": 23,
    "description": "Google Sheets is a cloud-based spreadsheet app that enables you to create, edit, and collaborate on spreadsheets online. With real-time collaboration, multiple users can work on the same sheet simultaneously, with changes instantly visible to everyone. Sheets supports formulas, charts, pivot tables, conditional formatting, and data visualization tools for advanced data analysis.\n\nIntegration with Google Drive allows for seamless file storage, access across devices, and sharing with specific permissions. Automated functions, smart fill, and AI-powered suggestions help streamline tasks, while offline access ensures productivity even without an internet connection.\n\nWhether for personal finance, business reports, or collaborative projects, Google Sheets offers a flexible, intuitive, and powerful platform to organize, analyze, and share data effortlessly.",
    "size": 80,
    "reviews": 700000,
    "ratingAvg": 4.3,
    "downloads": 150000000,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 600000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888848.png",
    "title": "Google Docs",
    "companyName": "Google LLC",
    "id": 24,
    "description": "Google Docs is a cloud-based word processor that allows you to create, edit, and collaborate on documents from any device. Real-time collaboration ensures that teams can work together seamlessly, with instant updates and commenting features for feedback. Docs supports rich text formatting, images, tables, links, and add-ons for extended functionality.\n\nAutomatic saving and version history allow you to track changes and recover previous versions if needed. Integration with Google Drive, Sheets, Slides, and other apps ensures a smooth workflow. Smart editing features like suggestions, voice typing, and AI-assisted grammar checks improve productivity and writing quality.\n\nWhether for school assignments, business reports, or personal projects, Google Docs provides a flexible, intuitive, and collaborative platform for all your document needs.",
    "size": 70,
    "reviews": 650000,
    "ratingAvg": 4.4,
    "downloads": 140000000,
    "ratings": [
      { "name": "1 star", "count": 9000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 560000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888854.png",
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "id": 25,
    "description": "Canva is a versatile graphic design platform that allows anyone to create stunning visuals, presentations, posters, social media graphics, and more. With an intuitive drag-and-drop interface, pre-designed templates, fonts, icons, and stock images, Canva empowers users to bring their creative ideas to life without prior design experience.\n\nThe app supports collaboration, enabling teams to work on projects together in real-time. Canva also allows exporting designs in multiple formats, sharing directly to social media, and printing professional-quality materials. With access to free and premium elements, it’s easy to customize visuals for any purpose.\n\nWhether you’re a student, marketer, designer, or small business owner, Canva provides the tools and flexibility to create professional-grade content quickly, efficiently, and creatively.",
    "size": 90,
    "reviews": 5000000,
    "ratingAvg": 4.7,
    "downloads": 200000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 4700000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888851.png",
    "title": "VSCO",
    "companyName": "VSCO",
    "id": 26,
    "description": "VSCO is a creative photo and video editing app that allows users to enhance their visual content with professional-grade tools. With a wide range of filters, presets, and advanced editing features, VSCO makes it easy to achieve the perfect aesthetic for your photos and videos. Users can adjust exposure, contrast, saturation, and more to create unique styles.\n\nThe app also offers a social platform to share your creations and explore work from other creatives worldwide. VSCO’s minimalist interface focuses on creative expression without distraction, allowing photographers and videographers to concentrate on quality and style.\n\nWhether you’re an aspiring creator, professional photographer, or casual user, VSCO provides the tools, inspiration, and community to elevate your visual storytelling and discover new creative possibilities.",
    "size": 80,
    "reviews": 800000,
    "ratingAvg": 4.3,
    "downloads": 60000000,
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 707000 }
    ]
  },
   {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888855.png",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "id": 27,
    "description": "Duolingo is a fun and engaging language learning app that helps you learn over 40 languages for free. Using bite-sized lessons, gamified exercises, and interactive challenges, Duolingo makes language acquisition enjoyable and effective. The app tracks your progress, provides daily goals, and motivates users with streaks, achievements, and rewards.\n\nThe app includes reading, writing, listening, and speaking exercises, ensuring comprehensive language skills development. Adaptive learning algorithms tailor lessons based on your strengths and weaknesses, allowing for efficient learning. Duolingo also offers podcasts, stories, and live tutoring for immersive experiences.\n\nWhether you’re learning a new language for travel, work, or personal growth, Duolingo combines educational research, gamification, and personalization to help you learn faster, retain more, and enjoy the journey.",
    "size": 70,
    "reviews": 3000000,
    "ratingAvg": 4.8,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 }]
    },
   
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888856.png",
    "title": "Clash of Clans",
    "companyName": "Supercell",
    "id": 28,
    "description": "Clash of Clans is an immersive strategy game where you build your village, train powerful troops, and battle with millions of players worldwide. Players can create clans, join forces with friends, and participate in epic clan wars. The game combines resource management, tactical combat, and community interaction to create an engaging experience.\n\nThe app features a variety of troops, defenses, and spells that can be strategically deployed to defeat opponents. Frequent events, seasonal updates, and special challenges keep gameplay fresh and exciting. Players can also watch replays, strategize with clanmates, and continuously upgrade their base for stronger defenses.\n\nWhether you’re a casual gamer or a competitive strategist, Clash of Clans offers endless hours of fun, strategic planning, and social interaction, making it one of the most popular mobile strategy games globally.",
    "size": 150,
    "reviews": 5000000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 4450000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888857.png",
    "title": "Candy Crush Saga",
    "companyName": "King",
    "id": 29,
    "description": "Candy Crush Saga is a delightful match-three puzzle game where players swap and match colorful candies to clear levels and achieve high scores. With thousands of levels, exciting challenges, and unique obstacles, the game keeps players entertained for hours. Special candies and boosters allow for strategic moves and satisfying chain reactions.\n\nThe app includes daily rewards, seasonal events, and competitive leaderboards to encourage engagement and progression. Players can sync their progress across devices and compete with friends to see who can reach the highest levels. The vibrant graphics, catchy music, and smooth gameplay make Candy Crush Saga a fun and addictive experience for all ages.\n\nWhether you’re a casual gamer looking for quick fun or a puzzle enthusiast seeking complex challenges, Candy Crush Saga provides a colorful, exciting, and highly enjoyable experience.",
    "size": 100,
    "reviews": 7000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 6700000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888858.png",
    "title": "Among Us",
    "companyName": "Innersloth",
    "id": 30,
    "description": "Among Us is a multiplayer social deduction game where crewmates work together to complete tasks aboard a spaceship while impostors attempt to sabotage and eliminate them. Players must discuss, analyze behaviors, and vote strategically to identify impostors and survive the game. The mix of cooperation, deception, and suspense creates an engaging and thrilling gameplay experience.\n\nThe app features various maps, customizable characters, and in-game chat options for communication. Regular updates, seasonal events, and community-driven content keep the game exciting and fresh. Players can also create private rooms to play with friends or join public games to meet others globally.\n\nWhether you enjoy strategy, social interaction, or problem-solving, Among Us offers a fun, challenging, and interactive experience that encourages teamwork, communication, and critical thinking.",
    "size": 60,
    "reviews": 3000000,
    "ratingAvg": 4.2,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 2800000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888853.png",
    "title": "Minecraft",
    "companyName": "Mojang",
    "id": 31,
    "description": "Minecraft is a sandbox game that lets players explore, build, and survive in limitless blocky worlds. Players can mine resources, craft tools, and construct creative structures or detailed landscapes. The game offers multiple modes including Survival, Creative, Adventure, and Hardcore, each providing unique challenges and experiences.\n\nMinecraft encourages creativity, problem-solving, and collaboration. Players can join multiplayer servers, engage in community challenges, and explore custom maps. The game also features regular updates, new biomes, creatures, and mechanics, ensuring a fresh experience.\n\nWhether you’re building grand structures, exploring caves, or surviving against monsters, Minecraft offers an open-ended, imaginative, and endlessly entertaining platform for players of all ages to unleash their creativity and enjoy immersive gameplay.",
    "size": 200,
    "reviews": 12000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 11000000 }
    ]
  }


]
